erpedt.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Этаж</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpedt.СХК_Расширение/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>УдалитьНоменклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>УдалитьУпаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>УдалитьХарактеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

erpedt.СХК_Расширение/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_ПринятТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0d012d0d-0f82-44cb-9d3b-79dd5ae817e2">
    <name>Отгрузил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СХК_НомерПалета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="323f8573-378e-4fef-931a-b93c2c113890">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpedt.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/ManagerModule.bsl
Функция НайтиРО(УИД) Экспорт

	Идентификатор = Новый УникальныйИдентификатор(УИД);
	Возврат  Документы.РасходныйОрдерНаТовары.ПолучитьСсылку(Идентификатор);
	
КонецФункции


Функция ПолучитьПользователяПоШК(ШК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ШтрихкодСотрудника.Ссылка КАК Ссылка,
	               |	СХК_ШтрихкодСотрудника.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	Справочник.СХК_ШтрихкодСотрудника КАК СХК_ШтрихкодСотрудника
	               |ГДЕ
	               |	СХК_ШтрихкодСотрудника.ШтрихКод = &ШтрихКод
	               |	И СХК_ШтрихкодСотрудника.Блокировка = ЛОЖЬ
	               |	И СХК_ШтрихкодСотрудника.Сотрудник.Недействителен = ЛОЖЬ";
	Запрос.УстановитьПараметр("ШтрихКод",ШК); 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Сотрудник;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
						
КонецФункции    

Процедура ИзменитьТайминг(ИмяПользователя) Экспорт
	Сотр = Пользователи.ПользовательПоНаименованию(ИмяПользователя); 
	НаборЗаписей = РегистрыСведений.СХК_ТаймингТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Сотр);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда 
		НовыйНомер = НаборЗаписей.Добавить();
		НовыйНомер.Пользователь = Сотр;
		НовыйНомер.Период = ТекущаяДата(); 
	Иначе
		НовыйНомер = НаборЗаписей[0];
		НовыйНомер.Период = ТекущаяДата();
	КонецЕсли;
	НаборЗаписей.Записать(Истина); 

КонецПроцедуры   

Функция ПроверитьТайминг(Сотрудник) Экспорт 
	НаборЗаписей = РегистрыСведений.СХК_ТаймингТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Сотрудник);
	НаборЗаписей.Прочитать();

	Тайминг = НаборЗаписей[0];
	Если ТекущаяДата() - Тайминг.Период > 900 Тогда
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции


      Функция ПоискНоменклатурыПоШК(Штрихкод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";  
	Запрос.УстановитьПараметр("Штрихкод",Штрихкод); 
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Номенклатура;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции  

 Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура,СерииНоменклатуры) Экспорт
	 СЗ = Новый Структура;
	 СЗ.Вставить("ЕдиницаИзмерения",Номенклатура.ЕдиницаИзмерения); 
	 Если ЗначениеЗаполнено(СерииНоменклатуры.СХК_Упаковка) Тогда
	 	СЗ.Вставить("Числитель",СерииНоменклатуры.СХК_Упаковка.Числитель); 
	Иначе
	 	СЗ.Вставить("Числитель",Номенклатура.ЕдиницаИзмерения.Числитель); 
	КонецЕсли;
	
	Возврат СЗ;
	
 КонецФункции
